{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Next:\n",
    "# Clean non-wanted nodes from graph (container categories etc.)\n",
    "#    Try: https://neo4j.com/docs/graph-algorithms/current/projected-graph-model/cypher-projection/\n",
    "# Write custom similarity calculation function\n",
    "# Write iterator function"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# NOTE\n",
    "# cypher.forbid_exhaustive_shortestpath=true set in neo4j conf file\n",
    "# https://neo4j.com/docs/operations-manual/current/configuration/neo4j-conf/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import *\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "pd.set_option('display.max_rows', 500)\n",
    "pd.set_option('display.max_columns', 500)\n",
    "pd.set_option('display.max_colwidth', 1000)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## FUNCTIONS"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Return similarity statistics for two sets (intersection, union, Jaccard coefficient)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# compute similarity statistics\n",
    "def similarityStats(a,b):\n",
    "    intSize = len(a.intersection(b))\n",
    "    unionSize = len(a.union(b))\n",
    "    return (intSize, unionSize, intSize / unionSize)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Return identifying information of parent categories of chosen article or category as pandas dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Give wikipedia id as integer as function argument (e.g. cateogry \"Finland\" = 693995)\n",
    "def parentCategories(a):\n",
    "    wikiID = a\n",
    "    commandToRun = 'MATCH (pages:Category:Page) \\\n",
    "                <-[:BELONGS_TO]- \\\n",
    "                (:Page {id: %s}) \\\n",
    "                RETURN pages.title, pages.id' % (wikiID)\n",
    "\n",
    "    return graph.run(commandToRun).to_data_frame()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Return identifying information of children (both category and article) of chosen category as pandas dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Give wikipedia id as integer as function argument (e.g. cateogry \"Finland\" = 693995)\n",
    "def childPages(a):\n",
    "    wikiID = a\n",
    "    commandToRun = 'MATCH (pages:Page) \\\n",
    "                -[:BELONGS_TO]-> \\\n",
    "                (:Page {id: %s}) \\\n",
    "                RETURN pages.title, pages.id' % (wikiID)\n",
    "\n",
    "    return graph.run(commandToRun).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Return dataframe with all articles (but not categories) with given title [only one result is expected]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Give wikipedia title as string as function argument\n",
    "def articleByTitle(a):\n",
    "    ArticleToFind = a\n",
    "    commandToRun = 'MATCH (articles:Page {title: \"%s\"}) \\\n",
    "                    WHERE NONE(art IN [articles] WHERE art:Category) \\\n",
    "                    RETURN articles.title, articles.id, ID(articles)' % (ArticleToFind)\n",
    "    return graph.run(commandToRun).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Return dataframe with all categories (but not articles) with given title [only one result is expected]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Give wikipedia title as string as function argument\n",
    "def categoryByTitle(a):\n",
    "    CategoryToFind = a\n",
    "    commandToRun = 'MATCH (categories:Category:Page {title: \"%s\"}) \\\n",
    "                    RETURN categories.title, categories.id, ID(categories)' % (CategoryToFind)\n",
    "    return graph.run(commandToRun).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Return dataframe containing all parent categories of category a and similarity statistics to each"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Give wikipedia id as integer as function argument (e.g. cateogry \"Finland\" = 693995)\n",
    "def parentSimilarities(a):\n",
    "    parents = parentCategories(a)\n",
    "    children = childPages(a)\n",
    "    parents[\"similarities\"] = parents[\"pages.id\"].apply(lambda x: similarityStats(set(children[\"pages.id\"]), set(childPages(x)[\"pages.id\"])))\n",
    "    parents[[\"intersection\", \"union\", \"jaccard\"]] = pd.DataFrame(parents['similarities'].tolist(), index = parents.index)\n",
    "    parents.drop([\"similarities\"], axis = 1, inplace = True)\n",
    "    parents.sort_values(by = \"jaccard\", ascending = False, inplace = True)\n",
    "    \n",
    "    return parents"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Return dataframe containing shortest path between input node (article or category) and Main_topics_classification category"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "def shortestPathToMTC(a):\n",
    "    # (:Page {id: 7345184}) is Main_topics_classifications category node\n",
    "    inputNode = a\n",
    "\n",
    "    commandToRun = 'MATCH path=shortestPath( \\\n",
    "                    (:Page {id: %s})-[:BELONGS_TO*0..10]-(:Page {id: 7345184})) \\\n",
    "                    UNWIND nodes(path) AS pages \\\n",
    "                    RETURN pages.title, pages.id, ID(pages)' % (inputNode)\n",
    "\n",
    "    return pd.DataFrame(graph.run(commandToRun).data())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Return node based on neo4j database ID [NOTE: not same as wikipedia ID used elsewhere]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "def getWithNeoID(a):\n",
    "    return NodeMatcher(graph).get(a)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Step A\n",
    "##### Article - Category relationship strength (TBD)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Step B\n",
    "##### Calculate similarity between two categories (Note: not an article and a category)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wall time: 2.51 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pages.title</th>\n",
       "      <th>pages.id</th>\n",
       "      <th>intersection</th>\n",
       "      <th>union</th>\n",
       "      <th>jaccard</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Humanities</td>\n",
       "      <td>1004110</td>\n",
       "      <td>2</td>\n",
       "      <td>128</td>\n",
       "      <td>0.015625</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Past</td>\n",
       "      <td>40822338</td>\n",
       "      <td>1</td>\n",
       "      <td>65</td>\n",
       "      <td>0.015385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Main_topic_classifications</td>\n",
       "      <td>7345184</td>\n",
       "      <td>1</td>\n",
       "      <td>68</td>\n",
       "      <td>0.014706</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Change</td>\n",
       "      <td>51137756</td>\n",
       "      <td>0</td>\n",
       "      <td>76</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Social_sciences</td>\n",
       "      <td>695042</td>\n",
       "      <td>0</td>\n",
       "      <td>125</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  pages.title  pages.id  intersection  union   jaccard\n",
       "2                  Humanities   1004110             2    128  0.015625\n",
       "0                        Past  40822338             1     65  0.015385\n",
       "1  Main_topic_classifications   7345184             1     68  0.014706\n",
       "3                      Change  51137756             0     76  0.000000\n",
       "4             Social_sciences    695042             0    125  0.000000"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "# function to calculate similarity between Category and all parent categories\n",
    "# Run-time for Category \"Finland\" on first run = 2.51 s\n",
    "chosenCategory = \"History\"\n",
    "\n",
    "chosenCatID = categoryByTitle(chosenCategory).iloc[0,1]\n",
    "parentSimilarities(chosenCatID)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Next: write iteration bottom-up\n",
    "# Write breadth first traversal top-down"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wall time: 73.3 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pages.title</th>\n",
       "      <th>pages.id</th>\n",
       "      <th>ID(pages)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Presidents_of_Finland</td>\n",
       "      <td>1017420</td>\n",
       "      <td>5548753</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Wikipedia_categories_named_after_Presidents_of_Finland</td>\n",
       "      <td>54302930</td>\n",
       "      <td>7278282</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Container_categories</td>\n",
       "      <td>30176254</td>\n",
       "      <td>6523822</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Main_topic_classifications</td>\n",
       "      <td>7345184</td>\n",
       "      <td>5614592</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              pages.title  pages.id  ID(pages)\n",
       "0                                   Presidents_of_Finland   1017420    5548753\n",
       "1  Wikipedia_categories_named_after_Presidents_of_Finland  54302930    7278282\n",
       "2                                    Container_categories  30176254    6523822\n",
       "3                              Main_topic_classifications   7345184    5614592"
      ]
     },
     "execution_count": 73,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "# (:Page {id: 7345184}) is Main_topics_classifications category node\n",
    "\n",
    "inputNode = 1017420\n",
    "\n",
    "commandToRun = 'MATCH path=shortestPath( \\\n",
    "                (:Page {id: %s})-[:BELONGS_TO*0..10]-(:Page {id: 7345184})) \\\n",
    "                UNWIND nodes(path) AS pages \\\n",
    "                RETURN pages.title, pages.id, ID(pages)' % (inputNode)\n",
    "\n",
    "'''cursor = graph.run(commandToRun)\n",
    "while cursor.forward():\n",
    "    print(cursor.current)'''\n",
    "\n",
    "shortestPath = pd.DataFrame(graph.run(commandToRun).data())\n",
    "shortestPath"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wall time: 1.08 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pages.title</th>\n",
       "      <th>pages.id</th>\n",
       "      <th>ID(pages)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>The_Good,_the_Bad_and_the_Ugly</td>\n",
       "      <td>31557</td>\n",
       "      <td>61550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Wikipedia_articles_with_GND_identifiers</td>\n",
       "      <td>38547977</td>\n",
       "      <td>6639522</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Law</td>\n",
       "      <td>18949668</td>\n",
       "      <td>2369701</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Law</td>\n",
       "      <td>691928</td>\n",
       "      <td>5214980</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Main_topic_classifications</td>\n",
       "      <td>7345184</td>\n",
       "      <td>5614592</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               pages.title  pages.id  ID(pages)\n",
       "0           The_Good,_the_Bad_and_the_Ugly     31557      61550\n",
       "1  Wikipedia_articles_with_GND_identifiers  38547977    6639522\n",
       "2                                      Law  18949668    2369701\n",
       "3                                      Law    691928    5214980\n",
       "4               Main_topic_classifications   7345184    5614592"
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "shortestPathToMTC(31557)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# MATCH path=shortestPath((station_44:STATION {id:44})-[*0..10]-(station_46:STATION {id:46}))\n",
    "# RETURN path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>categories.title</th>\n",
       "      <th>categories.id</th>\n",
       "      <th>ID(categories)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Articles</td>\n",
       "      <td>14104879</td>\n",
       "      <td>5721289</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  categories.title  categories.id  ID(categories)\n",
       "0         Articles       14104879         5721289"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "categoryByTitle('Articles')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>articles.title</th>\n",
       "      <th>articles.id</th>\n",
       "      <th>ID(articles)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>The_Good,_the_Bad_and_the_Ugly</td>\n",
       "      <td>31557</td>\n",
       "      <td>61550</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   articles.title  articles.id  ID(articles)\n",
       "0  The_Good,_the_Bad_and_the_Ugly        31557         61550"
      ]
     },
     "execution_count": 83,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "articleByTitle('The_Good,_the_Bad_and_the_Ugly')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(_2012406:Page {id: 14616326, isNew: false, isRedirect: false, title: 'Politics_in_Futurama'})"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "getWithNeoID(2012406)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 106,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "childPages(36)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wall time: 23.9 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 105,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "parentCategories(36)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "childPages(693995)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wall time: 19.5 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>categories.title</th>\n",
       "      <th>categories.id</th>\n",
       "      <th>ID(categories)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Contents</td>\n",
       "      <td>14105005</td>\n",
       "      <td>5721293</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  categories.title  categories.id  ID(categories)\n",
       "0         Contents       14105005         5721293"
      ]
     },
     "execution_count": 104,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "# Return Category with specific title only if is a category\n",
    "\n",
    "CategoryToFind = 'Contents'\n",
    "commandToRun = 'MATCH (categories:Category:Page {title: \"%s\"}) \\\n",
    "                RETURN categories.title, categories.id, ID(categories)' % (CategoryToFind)\n",
    "namedCategory = graph.run(commandToRun).to_data_frame()\n",
    "namedCategory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "set(parentCats[\"pages.id\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Perform similarity calculation on each parent"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Select highest similarity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Test stuff -->"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Clean unwatnted nodes\n",
    "# Return nodes with title containing unwanted strings\n",
    "# Create graph excluding these"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "“by_year”, “of_the_year”, “List_of”, or “_in_”\n",
    "'Wikipedia_'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "MATCH (n:Person)\n",
    "WHERE n.name = 'Peter' XOR (n.age < 30 AND n.name = 'Timothy') OR NOT (n.name = 'Timothy' OR n.name = 'Peter')\n",
    "RETURN n.name, n.age"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wall time: 14.5 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "commandToRun = \"MATCH (pages:Category:Page) \\\n",
    "                WHERE \\\n",
    "                pages.title STARTS WITH 'Wikipedia_' \\\n",
    "                OR pages.title STARTS WITH '1' \\\n",
    "                OR pages.title STARTS WITH '2' \\\n",
    "                OR pages.title STARTS WITH '3' \\\n",
    "                OR pages.title STARTS WITH '4' \\\n",
    "                OR pages.title STARTS WITH '5' \\\n",
    "                OR pages.title STARTS WITH '6' \\\n",
    "                OR pages.title STARTS WITH '7' \\\n",
    "                OR pages.title STARTS WITH '8' \\\n",
    "                OR pages.title STARTS WITH '9' \\\n",
    "                OR pages.title STARTS WITH '0' \\\n",
    "                OR pages.title STARTS WITH 'List_of' \\\n",
    "                OR pages.title CONTAINS 'by_year' \\\n",
    "                OR pages.title CONTAINS 'of_the_year' \\\n",
    "                OR pages.title CONTAINS '_in_' \\\n",
    "                RETURN pages.title, pages.id \\\n",
    "                \"\n",
    "nonWanted = graph.run(commandToRun).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pages.title</th>\n",
       "      <th>pages.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>500000</th>\n",
       "      <td>New_Zealand_cricket_in_the_19th_century</td>\n",
       "      <td>8482806</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500001</th>\n",
       "      <td>New_Zealand_cricket_in_the_20th_century</td>\n",
       "      <td>8437038</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500002</th>\n",
       "      <td>New_Zealand_cricket_in_the_21st_century</td>\n",
       "      <td>8407217</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500003</th>\n",
       "      <td>New_Zealand_diaspora_in_Asia</td>\n",
       "      <td>48218395</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500004</th>\n",
       "      <td>New_Zealand_diaspora_in_Malaysia</td>\n",
       "      <td>48218373</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500005</th>\n",
       "      <td>New_Zealand_expatriate_basketball_people_in_Serbia</td>\n",
       "      <td>56292076</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500006</th>\n",
       "      <td>New_Zealand_expatriate_basketball_people_in_the_United_States</td>\n",
       "      <td>25275220</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500007</th>\n",
       "      <td>New_Zealand_expatriate_sportspeople_in_Australia</td>\n",
       "      <td>20927926</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500008</th>\n",
       "      <td>New_Zealand_expatriate_sportspeople_in_the_United_Kingdom</td>\n",
       "      <td>20986927</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500009</th>\n",
       "      <td>New_Zealand_expatriates_in_Afghanistan</td>\n",
       "      <td>56128466</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500010</th>\n",
       "      <td>New_Zealand_expatriates_in_American_Samoa</td>\n",
       "      <td>52361111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500011</th>\n",
       "      <td>New_Zealand_expatriates_in_Australia</td>\n",
       "      <td>20435232</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500012</th>\n",
       "      <td>New_Zealand_expatriates_in_Bangladesh</td>\n",
       "      <td>52438185</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500013</th>\n",
       "      <td>New_Zealand_expatriates_in_Belgium</td>\n",
       "      <td>36133190</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500014</th>\n",
       "      <td>New_Zealand_expatriates_in_Canada</td>\n",
       "      <td>21053718</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500015</th>\n",
       "      <td>New_Zealand_expatriates_in_China</td>\n",
       "      <td>33019844</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500016</th>\n",
       "      <td>New_Zealand_expatriates_in_Croatia</td>\n",
       "      <td>39015506</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500017</th>\n",
       "      <td>New_Zealand_expatriates_in_Denmark</td>\n",
       "      <td>38995830</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500018</th>\n",
       "      <td>New_Zealand_expatriates_in_East_Timor</td>\n",
       "      <td>38713912</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500019</th>\n",
       "      <td>New_Zealand_expatriates_in_England</td>\n",
       "      <td>46969244</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500020</th>\n",
       "      <td>New_Zealand_expatriates_in_Fiji</td>\n",
       "      <td>36320842</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500021</th>\n",
       "      <td>New_Zealand_expatriates_in_France</td>\n",
       "      <td>26723899</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500022</th>\n",
       "      <td>New_Zealand_expatriates_in_Germany</td>\n",
       "      <td>27382630</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500023</th>\n",
       "      <td>New_Zealand_expatriates_in_Greece</td>\n",
       "      <td>31933169</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500024</th>\n",
       "      <td>New_Zealand_expatriates_in_Haiti</td>\n",
       "      <td>46405290</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500025</th>\n",
       "      <td>New_Zealand_expatriates_in_Hong_Kong</td>\n",
       "      <td>33019888</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500026</th>\n",
       "      <td>New_Zealand_expatriates_in_Hungary</td>\n",
       "      <td>31933172</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500027</th>\n",
       "      <td>New_Zealand_expatriates_in_Iceland</td>\n",
       "      <td>38995822</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500028</th>\n",
       "      <td>New_Zealand_expatriates_in_India</td>\n",
       "      <td>34813436</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500029</th>\n",
       "      <td>New_Zealand_expatriates_in_Indonesia</td>\n",
       "      <td>38713923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500030</th>\n",
       "      <td>New_Zealand_expatriates_in_Iran</td>\n",
       "      <td>38713715</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500031</th>\n",
       "      <td>New_Zealand_expatriates_in_Ireland</td>\n",
       "      <td>37244856</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500032</th>\n",
       "      <td>New_Zealand_expatriates_in_Italy</td>\n",
       "      <td>38997405</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500033</th>\n",
       "      <td>New_Zealand_expatriates_in_Japan</td>\n",
       "      <td>39005356</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500034</th>\n",
       "      <td>New_Zealand_expatriates_in_Kiribati</td>\n",
       "      <td>36320847</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500035</th>\n",
       "      <td>New_Zealand_expatriates_in_Malaysia</td>\n",
       "      <td>36133405</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500036</th>\n",
       "      <td>New_Zealand_expatriates_in_Monaco</td>\n",
       "      <td>29415006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500037</th>\n",
       "      <td>New_Zealand_expatriates_in_Nauru</td>\n",
       "      <td>38303384</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500038</th>\n",
       "      <td>New_Zealand_expatriates_in_Nigeria</td>\n",
       "      <td>39015481</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500039</th>\n",
       "      <td>New_Zealand_expatriates_in_Norway</td>\n",
       "      <td>31933163</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500040</th>\n",
       "      <td>New_Zealand_expatriates_in_Pakistan</td>\n",
       "      <td>33385423</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500041</th>\n",
       "      <td>New_Zealand_expatriates_in_Papua_New_Guinea</td>\n",
       "      <td>38890323</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500042</th>\n",
       "      <td>New_Zealand_expatriates_in_Peru</td>\n",
       "      <td>53183821</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500043</th>\n",
       "      <td>New_Zealand_expatriates_in_Poland</td>\n",
       "      <td>30139219</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500044</th>\n",
       "      <td>New_Zealand_expatriates_in_Romania</td>\n",
       "      <td>37252283</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500045</th>\n",
       "      <td>New_Zealand_expatriates_in_Samoa</td>\n",
       "      <td>36320858</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500046</th>\n",
       "      <td>New_Zealand_expatriates_in_Singapore</td>\n",
       "      <td>36133415</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500047</th>\n",
       "      <td>New_Zealand_expatriates_in_South_Africa</td>\n",
       "      <td>39016147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500048</th>\n",
       "      <td>New_Zealand_expatriates_in_Spain</td>\n",
       "      <td>47781465</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500049</th>\n",
       "      <td>New_Zealand_expatriates_in_Sri_Lanka</td>\n",
       "      <td>39068007</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500050</th>\n",
       "      <td>New_Zealand_expatriates_in_Sweden</td>\n",
       "      <td>47085082</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500051</th>\n",
       "      <td>New_Zealand_expatriates_in_Switzerland</td>\n",
       "      <td>38702353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500052</th>\n",
       "      <td>New_Zealand_expatriates_in_Thailand</td>\n",
       "      <td>49263048</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500053</th>\n",
       "      <td>New_Zealand_expatriates_in_Tonga</td>\n",
       "      <td>36320870</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500054</th>\n",
       "      <td>New_Zealand_expatriates_in_Turkey</td>\n",
       "      <td>38713705</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500055</th>\n",
       "      <td>New_Zealand_expatriates_in_Tuvalu</td>\n",
       "      <td>38303395</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500056</th>\n",
       "      <td>New_Zealand_expatriates_in_Vanuatu</td>\n",
       "      <td>38633264</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500057</th>\n",
       "      <td>New_Zealand_expatriates_in_the_Netherlands</td>\n",
       "      <td>31933161</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500058</th>\n",
       "      <td>New_Zealand_expatriates_in_the_Philippines</td>\n",
       "      <td>42216609</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500059</th>\n",
       "      <td>New_Zealand_expatriates_in_the_Solomon_Islands</td>\n",
       "      <td>38568043</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500060</th>\n",
       "      <td>New_Zealand_expatriates_in_the_United_Arab_Emirates</td>\n",
       "      <td>39067945</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500061</th>\n",
       "      <td>New_Zealand_expatriates_in_the_United_Kingdom</td>\n",
       "      <td>6804869</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500062</th>\n",
       "      <td>New_Zealand_expatriates_in_the_United_States</td>\n",
       "      <td>20843578</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500063</th>\n",
       "      <td>New_Zealand_in_World_War_I</td>\n",
       "      <td>30501362</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500064</th>\n",
       "      <td>New_Zealand_in_World_War_II</td>\n",
       "      <td>31378825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500065</th>\n",
       "      <td>New_Zealand_in_fiction</td>\n",
       "      <td>28868163</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500066</th>\n",
       "      <td>New_Zealand_in_fiction_by_city</td>\n",
       "      <td>44349680</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500067</th>\n",
       "      <td>New_Zealand_in_international_cricket</td>\n",
       "      <td>8454898</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500068</th>\n",
       "      <td>New_Zealand_military_personnel_killed_in_World_War_I</td>\n",
       "      <td>14200046</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500069</th>\n",
       "      <td>New_Zealand_military_personnel_killed_in_World_War_II</td>\n",
       "      <td>14200170</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500070</th>\n",
       "      <td>New_Zealand_military_personnel_killed_in_action</td>\n",
       "      <td>8046523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500071</th>\n",
       "      <td>New_Zealand_military_personnel_of_the_War_in_Afghanistan_(2001–2014)</td>\n",
       "      <td>56464838</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500072</th>\n",
       "      <td>New_Zealand_military_personnel_of_the_War_in_Afghanistan_(2001–present)</td>\n",
       "      <td>24355774</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500073</th>\n",
       "      <td>New_Zealand_people_in_arts_occupations</td>\n",
       "      <td>49980978</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500074</th>\n",
       "      <td>New_Zealand_people_in_health_professions</td>\n",
       "      <td>49974530</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500075</th>\n",
       "      <td>New_Zealand_people_in_rail_transport</td>\n",
       "      <td>22944543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500076</th>\n",
       "      <td>New_Zealand_people_in_sports</td>\n",
       "      <td>57572735</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500077</th>\n",
       "      <td>New_Zealand_people_in_the_video_game_industry</td>\n",
       "      <td>52947074</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500078</th>\n",
       "      <td>New_Zealand_people_who_died_in_prison_custody</td>\n",
       "      <td>19809705</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500079</th>\n",
       "      <td>New_Zealand_prisoners_of_war_in_World_War_I</td>\n",
       "      <td>57670140</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500080</th>\n",
       "      <td>New_Zealand_prisoners_of_war_in_World_War_II</td>\n",
       "      <td>57670135</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500081</th>\n",
       "      <td>New_Zealand_sportspeople_in_doping_cases</td>\n",
       "      <td>6441315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500082</th>\n",
       "      <td>New_Zealand_women_in_World_War_I</td>\n",
       "      <td>30824439</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500083</th>\n",
       "      <td>New_Zealand_women_in_politics</td>\n",
       "      <td>18404793</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500084</th>\n",
       "      <td>New_religious_movements_in_popular_culture</td>\n",
       "      <td>14480761</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500085</th>\n",
       "      <td>New_restoration_sects_in_the_Latter_Day_Saint_movement</td>\n",
       "      <td>27823490</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500086</th>\n",
       "      <td>New_towns_in_Egypt</td>\n",
       "      <td>31558159</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500087</th>\n",
       "      <td>New_towns_in_England</td>\n",
       "      <td>32188706</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500088</th>\n",
       "      <td>New_towns_in_France</td>\n",
       "      <td>49169389</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500089</th>\n",
       "      <td>New_towns_in_Hong_Kong</td>\n",
       "      <td>1284977</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500090</th>\n",
       "      <td>New_towns_in_Ireland</td>\n",
       "      <td>8601268</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500091</th>\n",
       "      <td>New_towns_in_Japan</td>\n",
       "      <td>32301780</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500092</th>\n",
       "      <td>New_towns_in_Scotland</td>\n",
       "      <td>32188748</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500093</th>\n",
       "      <td>New_towns_in_Singapore</td>\n",
       "      <td>1753135</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500094</th>\n",
       "      <td>New_towns_in_South_Korea</td>\n",
       "      <td>32215653</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500095</th>\n",
       "      <td>New_towns_in_the_United_Kingdom</td>\n",
       "      <td>8601201</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500096</th>\n",
       "      <td>New_towns_in_Île-de-France</td>\n",
       "      <td>49169383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500097</th>\n",
       "      <td>Newark,_New_Jersey_in_fiction</td>\n",
       "      <td>43791303</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500098</th>\n",
       "      <td>Newcastle_upon_Tyne_in_fiction</td>\n",
       "      <td>32143768</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500099</th>\n",
       "      <td>Newfoundland_and_Labrador_in_fiction</td>\n",
       "      <td>19638511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500100</th>\n",
       "      <td>Newfoundland_in_World_War_I</td>\n",
       "      <td>30501372</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500101</th>\n",
       "      <td>Newfoundland_in_World_War_II</td>\n",
       "      <td>57735738</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500102</th>\n",
       "      <td>News/talk_radio_stations_in_the_United_States</td>\n",
       "      <td>32671322</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500103</th>\n",
       "      <td>News_agencies_based_in_Abkhazia</td>\n",
       "      <td>57812174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500104</th>\n",
       "      <td>News_agencies_based_in_Afghanistan</td>\n",
       "      <td>57812472</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500105</th>\n",
       "      <td>News_agencies_based_in_Albania</td>\n",
       "      <td>57812281</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500106</th>\n",
       "      <td>News_agencies_based_in_Algeria</td>\n",
       "      <td>57812289</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500107</th>\n",
       "      <td>News_agencies_based_in_Argentina</td>\n",
       "      <td>57815451</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500108</th>\n",
       "      <td>News_agencies_based_in_Armenia</td>\n",
       "      <td>57812343</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500109</th>\n",
       "      <td>News_agencies_based_in_Australia</td>\n",
       "      <td>47257075</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500110</th>\n",
       "      <td>News_agencies_based_in_Austria</td>\n",
       "      <td>57812388</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500111</th>\n",
       "      <td>News_agencies_based_in_Azerbaijan</td>\n",
       "      <td>38478114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500112</th>\n",
       "      <td>News_agencies_based_in_Bahrain</td>\n",
       "      <td>57817498</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500113</th>\n",
       "      <td>News_agencies_based_in_Bangladesh</td>\n",
       "      <td>57812507</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500114</th>\n",
       "      <td>News_agencies_based_in_Barbados</td>\n",
       "      <td>57812669</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500115</th>\n",
       "      <td>News_agencies_based_in_Belarus</td>\n",
       "      <td>51048461</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500116</th>\n",
       "      <td>News_agencies_based_in_Belgium</td>\n",
       "      <td>57812574</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500117</th>\n",
       "      <td>News_agencies_based_in_Bolivia</td>\n",
       "      <td>57812205</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500118</th>\n",
       "      <td>News_agencies_based_in_Bosnia_and_Herzegovina</td>\n",
       "      <td>57812688</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500119</th>\n",
       "      <td>News_agencies_based_in_Brazil</td>\n",
       "      <td>37102689</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500120</th>\n",
       "      <td>News_agencies_based_in_Bulgaria</td>\n",
       "      <td>57812662</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500121</th>\n",
       "      <td>News_agencies_based_in_Cambodia</td>\n",
       "      <td>57812196</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500122</th>\n",
       "      <td>News_agencies_based_in_Canada</td>\n",
       "      <td>31780769</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500123</th>\n",
       "      <td>News_agencies_based_in_Cape_Verde</td>\n",
       "      <td>57813199</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500124</th>\n",
       "      <td>News_agencies_based_in_China</td>\n",
       "      <td>54227370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500125</th>\n",
       "      <td>News_agencies_based_in_Croatia</td>\n",
       "      <td>57812728</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500126</th>\n",
       "      <td>News_agencies_based_in_Cuba</td>\n",
       "      <td>57815204</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500127</th>\n",
       "      <td>News_agencies_based_in_Cyprus</td>\n",
       "      <td>56199961</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500128</th>\n",
       "      <td>News_agencies_based_in_Denmark</td>\n",
       "      <td>57815250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500129</th>\n",
       "      <td>News_agencies_based_in_East_Timor</td>\n",
       "      <td>57815500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500130</th>\n",
       "      <td>News_agencies_based_in_Egypt</td>\n",
       "      <td>57817520</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500131</th>\n",
       "      <td>News_agencies_based_in_Estonia</td>\n",
       "      <td>57812497</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500132</th>\n",
       "      <td>News_agencies_based_in_Ethiopia</td>\n",
       "      <td>57813023</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500133</th>\n",
       "      <td>News_agencies_based_in_Fiji</td>\n",
       "      <td>57815152</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500134</th>\n",
       "      <td>News_agencies_based_in_Finland</td>\n",
       "      <td>57813053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500135</th>\n",
       "      <td>News_agencies_based_in_France</td>\n",
       "      <td>40276403</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500136</th>\n",
       "      <td>News_agencies_based_in_French_Polynesia</td>\n",
       "      <td>57815422</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500137</th>\n",
       "      <td>News_agencies_based_in_Georgia_(country)</td>\n",
       "      <td>57813067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500138</th>\n",
       "      <td>News_agencies_based_in_Germany</td>\n",
       "      <td>47257093</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500139</th>\n",
       "      <td>News_agencies_based_in_Ghana</td>\n",
       "      <td>35172240</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500140</th>\n",
       "      <td>News_agencies_based_in_Greece</td>\n",
       "      <td>57812368</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500141</th>\n",
       "      <td>News_agencies_based_in_Hong_Kong</td>\n",
       "      <td>51366155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500142</th>\n",
       "      <td>News_agencies_based_in_Hungary</td>\n",
       "      <td>57813368</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500143</th>\n",
       "      <td>News_agencies_based_in_India</td>\n",
       "      <td>31780770</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500144</th>\n",
       "      <td>News_agencies_based_in_Indonesia</td>\n",
       "      <td>57812327</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500145</th>\n",
       "      <td>News_agencies_based_in_Iran</td>\n",
       "      <td>31780773</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500146</th>\n",
       "      <td>News_agencies_based_in_Iraq</td>\n",
       "      <td>57815068</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500147</th>\n",
       "      <td>News_agencies_based_in_Ireland</td>\n",
       "      <td>57813106</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500148</th>\n",
       "      <td>News_agencies_based_in_Israel</td>\n",
       "      <td>50987726</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>500149</th>\n",
       "      <td>News_agencies_based_in_Italy</td>\n",
       "      <td>17567289</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                    pages.title  \\\n",
       "500000                                  New_Zealand_cricket_in_the_19th_century   \n",
       "500001                                  New_Zealand_cricket_in_the_20th_century   \n",
       "500002                                  New_Zealand_cricket_in_the_21st_century   \n",
       "500003                                             New_Zealand_diaspora_in_Asia   \n",
       "500004                                         New_Zealand_diaspora_in_Malaysia   \n",
       "500005                       New_Zealand_expatriate_basketball_people_in_Serbia   \n",
       "500006            New_Zealand_expatriate_basketball_people_in_the_United_States   \n",
       "500007                         New_Zealand_expatriate_sportspeople_in_Australia   \n",
       "500008                New_Zealand_expatriate_sportspeople_in_the_United_Kingdom   \n",
       "500009                                   New_Zealand_expatriates_in_Afghanistan   \n",
       "500010                                New_Zealand_expatriates_in_American_Samoa   \n",
       "500011                                     New_Zealand_expatriates_in_Australia   \n",
       "500012                                    New_Zealand_expatriates_in_Bangladesh   \n",
       "500013                                       New_Zealand_expatriates_in_Belgium   \n",
       "500014                                        New_Zealand_expatriates_in_Canada   \n",
       "500015                                         New_Zealand_expatriates_in_China   \n",
       "500016                                       New_Zealand_expatriates_in_Croatia   \n",
       "500017                                       New_Zealand_expatriates_in_Denmark   \n",
       "500018                                    New_Zealand_expatriates_in_East_Timor   \n",
       "500019                                       New_Zealand_expatriates_in_England   \n",
       "500020                                          New_Zealand_expatriates_in_Fiji   \n",
       "500021                                        New_Zealand_expatriates_in_France   \n",
       "500022                                       New_Zealand_expatriates_in_Germany   \n",
       "500023                                        New_Zealand_expatriates_in_Greece   \n",
       "500024                                         New_Zealand_expatriates_in_Haiti   \n",
       "500025                                     New_Zealand_expatriates_in_Hong_Kong   \n",
       "500026                                       New_Zealand_expatriates_in_Hungary   \n",
       "500027                                       New_Zealand_expatriates_in_Iceland   \n",
       "500028                                         New_Zealand_expatriates_in_India   \n",
       "500029                                     New_Zealand_expatriates_in_Indonesia   \n",
       "500030                                          New_Zealand_expatriates_in_Iran   \n",
       "500031                                       New_Zealand_expatriates_in_Ireland   \n",
       "500032                                         New_Zealand_expatriates_in_Italy   \n",
       "500033                                         New_Zealand_expatriates_in_Japan   \n",
       "500034                                      New_Zealand_expatriates_in_Kiribati   \n",
       "500035                                      New_Zealand_expatriates_in_Malaysia   \n",
       "500036                                        New_Zealand_expatriates_in_Monaco   \n",
       "500037                                         New_Zealand_expatriates_in_Nauru   \n",
       "500038                                       New_Zealand_expatriates_in_Nigeria   \n",
       "500039                                        New_Zealand_expatriates_in_Norway   \n",
       "500040                                      New_Zealand_expatriates_in_Pakistan   \n",
       "500041                              New_Zealand_expatriates_in_Papua_New_Guinea   \n",
       "500042                                          New_Zealand_expatriates_in_Peru   \n",
       "500043                                        New_Zealand_expatriates_in_Poland   \n",
       "500044                                       New_Zealand_expatriates_in_Romania   \n",
       "500045                                         New_Zealand_expatriates_in_Samoa   \n",
       "500046                                     New_Zealand_expatriates_in_Singapore   \n",
       "500047                                  New_Zealand_expatriates_in_South_Africa   \n",
       "500048                                         New_Zealand_expatriates_in_Spain   \n",
       "500049                                     New_Zealand_expatriates_in_Sri_Lanka   \n",
       "500050                                        New_Zealand_expatriates_in_Sweden   \n",
       "500051                                   New_Zealand_expatriates_in_Switzerland   \n",
       "500052                                      New_Zealand_expatriates_in_Thailand   \n",
       "500053                                         New_Zealand_expatriates_in_Tonga   \n",
       "500054                                        New_Zealand_expatriates_in_Turkey   \n",
       "500055                                        New_Zealand_expatriates_in_Tuvalu   \n",
       "500056                                       New_Zealand_expatriates_in_Vanuatu   \n",
       "500057                               New_Zealand_expatriates_in_the_Netherlands   \n",
       "500058                               New_Zealand_expatriates_in_the_Philippines   \n",
       "500059                           New_Zealand_expatriates_in_the_Solomon_Islands   \n",
       "500060                      New_Zealand_expatriates_in_the_United_Arab_Emirates   \n",
       "500061                            New_Zealand_expatriates_in_the_United_Kingdom   \n",
       "500062                             New_Zealand_expatriates_in_the_United_States   \n",
       "500063                                               New_Zealand_in_World_War_I   \n",
       "500064                                              New_Zealand_in_World_War_II   \n",
       "500065                                                   New_Zealand_in_fiction   \n",
       "500066                                           New_Zealand_in_fiction_by_city   \n",
       "500067                                     New_Zealand_in_international_cricket   \n",
       "500068                     New_Zealand_military_personnel_killed_in_World_War_I   \n",
       "500069                    New_Zealand_military_personnel_killed_in_World_War_II   \n",
       "500070                          New_Zealand_military_personnel_killed_in_action   \n",
       "500071     New_Zealand_military_personnel_of_the_War_in_Afghanistan_(2001–2014)   \n",
       "500072  New_Zealand_military_personnel_of_the_War_in_Afghanistan_(2001–present)   \n",
       "500073                                   New_Zealand_people_in_arts_occupations   \n",
       "500074                                 New_Zealand_people_in_health_professions   \n",
       "500075                                     New_Zealand_people_in_rail_transport   \n",
       "500076                                             New_Zealand_people_in_sports   \n",
       "500077                            New_Zealand_people_in_the_video_game_industry   \n",
       "500078                            New_Zealand_people_who_died_in_prison_custody   \n",
       "500079                              New_Zealand_prisoners_of_war_in_World_War_I   \n",
       "500080                             New_Zealand_prisoners_of_war_in_World_War_II   \n",
       "500081                                 New_Zealand_sportspeople_in_doping_cases   \n",
       "500082                                         New_Zealand_women_in_World_War_I   \n",
       "500083                                            New_Zealand_women_in_politics   \n",
       "500084                               New_religious_movements_in_popular_culture   \n",
       "500085                   New_restoration_sects_in_the_Latter_Day_Saint_movement   \n",
       "500086                                                       New_towns_in_Egypt   \n",
       "500087                                                     New_towns_in_England   \n",
       "500088                                                      New_towns_in_France   \n",
       "500089                                                   New_towns_in_Hong_Kong   \n",
       "500090                                                     New_towns_in_Ireland   \n",
       "500091                                                       New_towns_in_Japan   \n",
       "500092                                                    New_towns_in_Scotland   \n",
       "500093                                                   New_towns_in_Singapore   \n",
       "500094                                                 New_towns_in_South_Korea   \n",
       "500095                                          New_towns_in_the_United_Kingdom   \n",
       "500096                                               New_towns_in_Île-de-France   \n",
       "500097                                            Newark,_New_Jersey_in_fiction   \n",
       "500098                                           Newcastle_upon_Tyne_in_fiction   \n",
       "500099                                     Newfoundland_and_Labrador_in_fiction   \n",
       "500100                                              Newfoundland_in_World_War_I   \n",
       "500101                                             Newfoundland_in_World_War_II   \n",
       "500102                            News/talk_radio_stations_in_the_United_States   \n",
       "500103                                          News_agencies_based_in_Abkhazia   \n",
       "500104                                       News_agencies_based_in_Afghanistan   \n",
       "500105                                           News_agencies_based_in_Albania   \n",
       "500106                                           News_agencies_based_in_Algeria   \n",
       "500107                                         News_agencies_based_in_Argentina   \n",
       "500108                                           News_agencies_based_in_Armenia   \n",
       "500109                                         News_agencies_based_in_Australia   \n",
       "500110                                           News_agencies_based_in_Austria   \n",
       "500111                                        News_agencies_based_in_Azerbaijan   \n",
       "500112                                           News_agencies_based_in_Bahrain   \n",
       "500113                                        News_agencies_based_in_Bangladesh   \n",
       "500114                                          News_agencies_based_in_Barbados   \n",
       "500115                                           News_agencies_based_in_Belarus   \n",
       "500116                                           News_agencies_based_in_Belgium   \n",
       "500117                                           News_agencies_based_in_Bolivia   \n",
       "500118                            News_agencies_based_in_Bosnia_and_Herzegovina   \n",
       "500119                                            News_agencies_based_in_Brazil   \n",
       "500120                                          News_agencies_based_in_Bulgaria   \n",
       "500121                                          News_agencies_based_in_Cambodia   \n",
       "500122                                            News_agencies_based_in_Canada   \n",
       "500123                                        News_agencies_based_in_Cape_Verde   \n",
       "500124                                             News_agencies_based_in_China   \n",
       "500125                                           News_agencies_based_in_Croatia   \n",
       "500126                                              News_agencies_based_in_Cuba   \n",
       "500127                                            News_agencies_based_in_Cyprus   \n",
       "500128                                           News_agencies_based_in_Denmark   \n",
       "500129                                        News_agencies_based_in_East_Timor   \n",
       "500130                                             News_agencies_based_in_Egypt   \n",
       "500131                                           News_agencies_based_in_Estonia   \n",
       "500132                                          News_agencies_based_in_Ethiopia   \n",
       "500133                                              News_agencies_based_in_Fiji   \n",
       "500134                                           News_agencies_based_in_Finland   \n",
       "500135                                            News_agencies_based_in_France   \n",
       "500136                                  News_agencies_based_in_French_Polynesia   \n",
       "500137                                 News_agencies_based_in_Georgia_(country)   \n",
       "500138                                           News_agencies_based_in_Germany   \n",
       "500139                                             News_agencies_based_in_Ghana   \n",
       "500140                                            News_agencies_based_in_Greece   \n",
       "500141                                         News_agencies_based_in_Hong_Kong   \n",
       "500142                                           News_agencies_based_in_Hungary   \n",
       "500143                                             News_agencies_based_in_India   \n",
       "500144                                         News_agencies_based_in_Indonesia   \n",
       "500145                                              News_agencies_based_in_Iran   \n",
       "500146                                              News_agencies_based_in_Iraq   \n",
       "500147                                           News_agencies_based_in_Ireland   \n",
       "500148                                            News_agencies_based_in_Israel   \n",
       "500149                                             News_agencies_based_in_Italy   \n",
       "\n",
       "        pages.id  \n",
       "500000   8482806  \n",
       "500001   8437038  \n",
       "500002   8407217  \n",
       "500003  48218395  \n",
       "500004  48218373  \n",
       "500005  56292076  \n",
       "500006  25275220  \n",
       "500007  20927926  \n",
       "500008  20986927  \n",
       "500009  56128466  \n",
       "500010  52361111  \n",
       "500011  20435232  \n",
       "500012  52438185  \n",
       "500013  36133190  \n",
       "500014  21053718  \n",
       "500015  33019844  \n",
       "500016  39015506  \n",
       "500017  38995830  \n",
       "500018  38713912  \n",
       "500019  46969244  \n",
       "500020  36320842  \n",
       "500021  26723899  \n",
       "500022  27382630  \n",
       "500023  31933169  \n",
       "500024  46405290  \n",
       "500025  33019888  \n",
       "500026  31933172  \n",
       "500027  38995822  \n",
       "500028  34813436  \n",
       "500029  38713923  \n",
       "500030  38713715  \n",
       "500031  37244856  \n",
       "500032  38997405  \n",
       "500033  39005356  \n",
       "500034  36320847  \n",
       "500035  36133405  \n",
       "500036  29415006  \n",
       "500037  38303384  \n",
       "500038  39015481  \n",
       "500039  31933163  \n",
       "500040  33385423  \n",
       "500041  38890323  \n",
       "500042  53183821  \n",
       "500043  30139219  \n",
       "500044  37252283  \n",
       "500045  36320858  \n",
       "500046  36133415  \n",
       "500047  39016147  \n",
       "500048  47781465  \n",
       "500049  39068007  \n",
       "500050  47085082  \n",
       "500051  38702353  \n",
       "500052  49263048  \n",
       "500053  36320870  \n",
       "500054  38713705  \n",
       "500055  38303395  \n",
       "500056  38633264  \n",
       "500057  31933161  \n",
       "500058  42216609  \n",
       "500059  38568043  \n",
       "500060  39067945  \n",
       "500061   6804869  \n",
       "500062  20843578  \n",
       "500063  30501362  \n",
       "500064  31378825  \n",
       "500065  28868163  \n",
       "500066  44349680  \n",
       "500067   8454898  \n",
       "500068  14200046  \n",
       "500069  14200170  \n",
       "500070   8046523  \n",
       "500071  56464838  \n",
       "500072  24355774  \n",
       "500073  49980978  \n",
       "500074  49974530  \n",
       "500075  22944543  \n",
       "500076  57572735  \n",
       "500077  52947074  \n",
       "500078  19809705  \n",
       "500079  57670140  \n",
       "500080  57670135  \n",
       "500081   6441315  \n",
       "500082  30824439  \n",
       "500083  18404793  \n",
       "500084  14480761  \n",
       "500085  27823490  \n",
       "500086  31558159  \n",
       "500087  32188706  \n",
       "500088  49169389  \n",
       "500089   1284977  \n",
       "500090   8601268  \n",
       "500091  32301780  \n",
       "500092  32188748  \n",
       "500093   1753135  \n",
       "500094  32215653  \n",
       "500095   8601201  \n",
       "500096  49169383  \n",
       "500097  43791303  \n",
       "500098  32143768  \n",
       "500099  19638511  \n",
       "500100  30501372  \n",
       "500101  57735738  \n",
       "500102  32671322  \n",
       "500103  57812174  \n",
       "500104  57812472  \n",
       "500105  57812281  \n",
       "500106  57812289  \n",
       "500107  57815451  \n",
       "500108  57812343  \n",
       "500109  47257075  \n",
       "500110  57812388  \n",
       "500111  38478114  \n",
       "500112  57817498  \n",
       "500113  57812507  \n",
       "500114  57812669  \n",
       "500115  51048461  \n",
       "500116  57812574  \n",
       "500117  57812205  \n",
       "500118  57812688  \n",
       "500119  37102689  \n",
       "500120  57812662  \n",
       "500121  57812196  \n",
       "500122  31780769  \n",
       "500123  57813199  \n",
       "500124  54227370  \n",
       "500125  57812728  \n",
       "500126  57815204  \n",
       "500127  56199961  \n",
       "500128  57815250  \n",
       "500129  57815500  \n",
       "500130  57817520  \n",
       "500131  57812497  \n",
       "500132  57813023  \n",
       "500133  57815152  \n",
       "500134  57813053  \n",
       "500135  40276403  \n",
       "500136  57815422  \n",
       "500137  57813067  \n",
       "500138  47257093  \n",
       "500139  35172240  \n",
       "500140  57812368  \n",
       "500141  51366155  \n",
       "500142  57813368  \n",
       "500143  31780770  \n",
       "500144  57812327  \n",
       "500145  31780773  \n",
       "500146  57815068  \n",
       "500147  57813106  \n",
       "500148  50987726  \n",
       "500149  17567289  "
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#nonWanted.loc[nonWanted[\"pages.title\"] == \"Wikipedia_articles_with_GND_identifiers\", :]\n",
    "nonWanted[500000:500150]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pages.title</th>\n",
       "      <th>pages.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Wikipedia_1.0_Arts_articles_by_quality</td>\n",
       "      <td>6024513</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Wikipedia_1.0_assessments</td>\n",
       "      <td>4887735</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Wikipedia_1.0_historical_pages</td>\n",
       "      <td>28286276</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Wikipedia_10</td>\n",
       "      <td>38308958</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Wikipedia_15</td>\n",
       "      <td>48576743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28771</th>\n",
       "      <td>Wikipedia_warning_essays</td>\n",
       "      <td>42046692</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28772</th>\n",
       "      <td>Wikipedia_women</td>\n",
       "      <td>57968295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28773</th>\n",
       "      <td>Wikipedia_workpages</td>\n",
       "      <td>11376362</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28774</th>\n",
       "      <td>Wikipedia_workshops_in_Mumbai</td>\n",
       "      <td>40149560</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28775</th>\n",
       "      <td>Wikipedia_years</td>\n",
       "      <td>3022307</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>28776 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  pages.title  pages.id\n",
       "0      Wikipedia_1.0_Arts_articles_by_quality   6024513\n",
       "1                   Wikipedia_1.0_assessments   4887735\n",
       "2              Wikipedia_1.0_historical_pages  28286276\n",
       "3                                Wikipedia_10  38308958\n",
       "4                                Wikipedia_15  48576743\n",
       "...                                       ...       ...\n",
       "28771                Wikipedia_warning_essays  42046692\n",
       "28772                         Wikipedia_women  57968295\n",
       "28773                     Wikipedia_workpages  11376362\n",
       "28774           Wikipedia_workshops_in_Mumbai  40149560\n",
       "28775                         Wikipedia_years   3022307\n",
       "\n",
       "[28776 rows x 2 columns]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# len \"STARTS WITH 'Wikipedia_'\" = 28776\n",
    "nonWanted"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "booksC = graph.run('MATCH (pages:Category:Page)-[:BELONGS_TO]->(:Page {title: \"Books\"}) RETURN pages.title, pages.id').to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "booksAll = graph.run('MATCH (pages:Page)-[:BELONGS_TO]->(:Page {title: \"Books\"}) RETURN pages.title, pages.id').to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "# Returns articles belonging to category \"Books\"\n",
    "booksArt = graph.run('MATCH (pages:Page)-[:BELONGS_TO]->(:Page {title: \"Books\"}) WHERE NONE(page IN [pages] WHERE page:Category) RETURN pages.title, pages.id').to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "booksAll2 = graph.run('MATCH (pages:Page)<-[:BELONGS_TO]-(:Page {title: \"Jacob_Abbot_Cummings\"}) RETURN pages').to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "print(len(booksC))\n",
    "print(len(booksArt))\n",
    "print(len(booksAll))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "booksAll2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Step 1\n",
    "##### Take article title as input and return dataframe with identifying information"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wall time: 87.2 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>articles.title</th>\n",
       "      <th>articles.id</th>\n",
       "      <th>ID(articles)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Cat</td>\n",
       "      <td>6678</td>\n",
       "      <td>7953</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  articles.title  articles.id  ID(articles)\n",
       "0            Cat         6678          7953"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "# Return page with specific title only if is not category\n",
    "# Without WHERE clause, will return both article and category of same name if it exists\n",
    "\n",
    "ArticleToFind = 'Cat'\n",
    "commandToRun = 'MATCH (articles:Page {title: \"%s\"}) \\\n",
    "                WHERE NONE(art IN [articles] WHERE art:Category) \\\n",
    "                RETURN articles.title, articles.id, ID(articles)' % (ArticleToFind)\n",
    "namedArticle = graph.run(commandToRun).to_data_frame()\n",
    "namedArticle"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Approach 2 - NOT NECESSARY"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [],
   "source": [
    "matcher = NodeMatcher(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "ArtWikiID = namedArticle[\"ID(articles)\"][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "len(graph.match((matcher.get(ArtWikiID), None ), \"BELONGS_TO\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "list(graph.match((matcher.get(ArtWikiID), None ), \"BELONGS_TO\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(_12:Page {id: 332, isNew: false, isRedirect: false, title: 'Animalia_(book)'})"
      ]
     },
     "execution_count": 111,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "matcher.get(12)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
